ericsonj/stm32f4disco/Core/Src/main.c
/**
 ******************************************************************************
 * @file    Templates/Src/main.c
 * @author  MCD Application Team
 * @brief   Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4_discovery.h"
#include <stdlib.h>
#include "tm_stm32_rtc.h"
#include "opus.h"
#include "GString.h"

/** @addtogroup STM32F4xx_HAL_Examples
 * @{
 */

/** @addtogroup Templates
 * @{
 */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

RNG_HandleTypeDef hrng;
RTC_HandleTypeDef hrtc;

/* Private function prototypes -----------------------------------------------*/
static void SystemClock_Config( void );
static void Error_Handler( void );

/* Private functions ---------------------------------------------------------*/
/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main( void ) {

	/* STM32F4xx HAL library initialization:
	 - Configure the Flash prefetch, Flash preread and Buffer caches
	 - Systick timer is configured by default as source of time base, but user
	 can eventually implement his proper time base source (a general purpose
	 timer for example or other time source), keeping in mind that Time base
	 duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and
	 handled in milliseconds basis.
	 - Low Level Initialization
	 */
	HAL_Init();

	/* Configure the system clock to 168 MHz */
	SystemClock_Config();

	/* Add your application code here
	 */
	BSP_LED_Init(LED3);
	BSP_LED_Init(LED4);
	BSP_LED_Init(LED5);
	BSP_LED_Init(LED6);

#ifdef __USE_CJSON__
//	cJSON_test();
#endif

	uint32_t randNum = 0;

	hrng.Instance = RNG;
	HAL_RNG_Init(&hrng);
	HAL_RNG_GenerateRandomNumber(&hrng, &randNum);
	HAL_RNG_GenerateRandomNumber(&hrng, &randNum);
	HAL_RNG_GenerateRandomNumber(&hrng, &randNum);
	HAL_RNG_GenerateRandomNumber(&hrng, &randNum);
	HAL_RNG_DeInit(&hrng);

#ifdef __USE_RTC__
	TM_RTC_t RTCD;
	RTCD.Day = 14;
	RTCD.Year = 20;
	RTCD.Month = 2;
	RTCD.WeekDay = 5;
	RTCD.Hours = 13;
	RTCD.Minutes = 15;
	RTCD.Seconds = 0;
	RTCD.Subseconds = 0;
	if (TM_RTC_Init(TM_RTC_ClockSource_Internal)){
		TM_RTC_SetDateTime(&RTCD, TM_RTC_Format_BCD);
	}

	HAL_Delay(60000);

	TM_RTC_GetDateTime(&RTCD, TM_RTC_Format_BCD);

	HAL_Delay(60000);

	TM_RTC_GetDateTime(&RTCD, TM_RTC_Format_BCD);
#endif

//	int err;
//	OpusDecoder *dec = NULL;
//	dec = opus_decoder_create(16000, 1, &err);
//	if (dec != NULL) {
//		opus_int16 data[10];
//		int res = opus_decode(dec, NULL, 0, data, 10, 0);
//	}

	GRoot root;
	root.g_malloc = malloc;
	root.g_free = free;
	GErr err;

	uint32_t startTicks = HAL_GetTick();

	int i = 0;
	for ( i = 0; i < 10000; i++ ) {

		GString* str = g_string_sized_new(&root, 64, &err);

		g_string_append_printf(&root, str, &err, "%s %s %s\r\n", "GET",
				"/index", "HTTP/1.1");
		g_string_append_printf(&root, str, &err, "%s: %s\r\n", "Server",
				"ericsonj.net");
		g_string_append_printf(&root, str, &err, "%s: %s\r\n", "Content-Type",
				"text/html;charset=UTF-8");
		g_string_append_printf(&root, str, &err, "%s: %d\r\n", "Content-Length",
				0);
		g_string_append(&root, str, "\r\n", &err);
		g_string_append(&root, str,
				"<html><head></head><body>Hello</body></html>", &err);

		g_string_free(&root, str, &err);

	}


	uint32_t endTicks = HAL_GetTick() - startTicks;

	/* Infinite loop */
	while ( 1 ) {
		BSP_LED_On(LED3);
		BSP_LED_On(LED5);
		BSP_LED_Off(LED4);
		BSP_LED_Off(LED6);
		HAL_Delay(endTicks);
		BSP_LED_On(LED4);
		BSP_LED_On(LED6);
		BSP_LED_Off(LED3);
		BSP_LED_Off(LED5);
		HAL_Delay(endTicks);
	}
}

/**
 * @brief  System Clock Configuration
 *         The system Clock is configured as follow :
 *            System Clock source            = PLL (HSE)
 *            SYSCLK(Hz)                     = 168000000
 *            HCLK(Hz)                       = 168000000
 *            AHB Prescaler                  = 1
 *            APB1 Prescaler                 = 4
 *            APB2 Prescaler                 = 2
 *            HSE Frequency(Hz)              = 8000000
 *            PLL_M                          = 8
 *            PLL_N                          = 336
 *            PLL_P                          = 2
 *            PLL_Q                          = 7
 *            VDD(V)                         = 3.3
 *            Main regulator output voltage  = Scale1 mode
 *            Flash Latency(WS)              = 5
 * @param  None
 * @retval None
 */
static void SystemClock_Config( void ) {
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_OscInitTypeDef RCC_OscInitStruct;

	/* Enable Power Control clock */
	__HAL_RCC_PWR_CLK_ENABLE()
	;

	/* The voltage scaling allows optimizing the power consumption when the device is
	 clocked below the maximum system frequency, to update the voltage scaling value
	 regarding system frequency refer to product datasheet.  */
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

	/* Enable HSE Oscillator and activate PLL with HSE as source */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 8;
	RCC_OscInitStruct.PLL.PLLN = 336;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 7;
	if ( HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK ) {
		/* Initialization Error */
		Error_Handler();
	}

	/* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
	 clocks dividers */
	RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK
			| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
	if ( HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK ) {
		/* Initialization Error */
		Error_Handler();
	}

	/* STM32F405x/407x/415x/417x Revision Z devices: prefetch is supported  */
	if ( HAL_GetREVID() == 0x1001 ) {
		/* Enable the Flash prefetch */
		__HAL_FLASH_PREFETCH_BUFFER_ENABLE();
	}
}
/**
 * @brief  This function is executed in case of error occurrence.
 * @param  None
 * @retval None
 */
static void Error_Handler( void ) {
	/* User may add here some code to deal with this error */
	while ( 1 ) {
	}
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
